cubes/cubes_en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-28 Sun 02:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Lowest Level PL</title>
<meta name="author" content="emporas" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>

</head>
<body>
<div id="content" class="content">
<h1 class="title">The Lowest Level PL</h1>
<div id="table-of-contents" role="doc-toc">
<h1><a accesskey="H" href="../index.html"> HOME </a></h1><h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8b7237f">Problem Statement</a></li>
<li><a href="#org0ba6db0">Math</a>
<ul>
<li><a href="#org14253af">Enumeration of placements</a></li>
<li><a href="#org72b2869">Inclusion–exclusion setup</a>
<ul>
<li><a href="#orgb7e5f9a">Total (no restrictions)</a></li>
<li><a href="#org196b0d8">One colour adjacent (e.g. \(A_R\))</a></li>
<li><a href="#orge6b0e17">Two colours adjacent (e.g. \(A_R\cap A_G\))</a></li>
<li><a href="#org92c7ca2">All three colours adjacent (\(A_R\cap A_G\cap A_B\))</a></li>
</ul>
</li>
<li><a href="#org9105297">Put everything together</a></li>
</ul>
</li>
<li><a href="#org2a5a050">Lean</a></li>
<li><a href="#org19a3ee0">Haskell</a></li>
<li><a href="#org66bccab">Rust</a></li>
</ul>
</div>
</div>
<p>
Let&rsquo;s compare the different implementations of a simple problem in three PLs. All three have some common characteristics.
</p>

<ul class="org-ul">
<li>Exhaustive pattern matching</li>
<li>No null/nil</li>
<li>Algeraic data types</li>
</ul>

<p>
The goal is to identify which PL of all is the lowest level.
</p>

<p>
Rust&rsquo;s implementation isn&rsquo;t ideal, but I kept it that way to be as similar as possible to the other implementations. Also Rust doesn&rsquo;t have recursion.
</p>

<p>
The math notation at some places cannot be copied, the renderer doesn&rsquo;t recognize it as a math tex notation. I cannot figure out why, but first time I wrote math using tex.
</p>
<div id="outline-container-org8b7237f" class="outline-2">
<h2 id="org8b7237f">Problem Statement</h2>
<div class="outline-text-2" id="text-org8b7237f">
<p>
<b>6 colored cubes into 9 holes</b>
</p>

<p>
We place six colored cubes — two red (R), two green (G), two blue (B) — into nine labeled holes (positions in a row). The remaining three holes are empty (we denote empty by E or &ldquo;.&rdquo;).
</p>

<p>
Constraint: <b><b>no two adjacent colored cubes of the same color</b></b> may occur. Empty holes may be adjacent to anything (including empties and same-colored neighbors).
</p>

<p>
How many distinct arrangements (sequences of length 9 of the multiset \(\{R^2,G^2,B^2,E^3\}\)) satisfy the adjacency constraint?
</p>
</div>
</div>
<div id="outline-container-org0ba6db0" class="outline-2">
<h2 id="org0ba6db0">Math</h2>
<div class="outline-text-2" id="text-org0ba6db0">
</div>
<div id="outline-container-org14253af" class="outline-3">
<h3 id="org14253af">Enumeration of placements</h3>
<div class="outline-text-3" id="text-org14253af">
<p>
Let the multiset be \(\{R,R,G,G,B,B,E,E,E\}\). Without adjacency restrictions, the number of distinct sequences is the multinomial
\[
N_{\text{total}}=\frac{9!}{2!\,2!\,2!\,3!}.
\]
</p>

<p>
Let for a colour \(X\in\{R,G,B\}\) the event \(A_X\) be ``the two \(X\)-cubes are adjacent somewhere in the sequence.&rsquo;&rsquo; Because each colour appears exactly twice, \(A_X\) is equivalent to the two \(X\)-cubes forming a single adjacent block \(XX\).
</p>

<p>
We want sequences avoiding all three events \(A_R,A_G,A_B\). We will count them by inclusion–exclusion.
</p>
</div>
</div>
<div id="outline-container-org72b2869" class="outline-3">
<h3 id="org72b2869">Inclusion–exclusion setup</h3>
<div class="outline-text-3" id="text-org72b2869">
<p>
By inclusion–exclusion,
</p>

<p>
N<sub>good</sub> = N<sub>total</sub> - &sum;<sub>X</sub> N(A<sub>X</sub>) + &sum;<sub>X&lt;Y</sub> N(A<sub>X&cap;</sub> A<sub>Y</sub>) - N(A<sub>R&cap;</sub> A<sub>G&cap;</sub> A<sub>B</sub>)
</p>

<p>
N<sub>good</sub> = N<sub>total</sub> - &sum;<sub>X&isin;\{R,G,B\}</sub> N(A<sub>X</sub>) + &sum;<sub>X&lt;Y</sub> N(A<sub>X&cap;</sub> A<sub>Y</sub>) - N(A<sub>R&cap;</sub> A<sub>G&cap;</sub> A<sub>B</sub>)
</p>

<p>
We compute each term by replacing each adjacent pair \(XX\) by a single block and counting permutations of the resulting multiset.
</p>
</div>
<div id="outline-container-orgb7e5f9a" class="outline-4">
<h4 id="orgb7e5f9a">Total (no restrictions)</h4>
<div class="outline-text-4" id="text-orgb7e5f9a">
<p>
\[
N_{\text{total}}=\frac{9!}{2!\,2!\,2!\,3!}.
\]
</p>

<p>
Compute the factorials and denominators explicitly:
</p>
\begin{align*}
9!&=362\,880,\\
2!\,2!\,2!\,3!&=2\cdot2\cdot2\cdot6=48,\\
N_{\text{total}}&=\frac{362\,880}{48}=7\,560.
\end{align*}
</div>
</div>
<div id="outline-container-org196b0d8" class="outline-4">
<h4 id="org196b0d8">One colour adjacent (e.g. \(A_R\))</h4>
<div class="outline-text-4" id="text-org196b0d8">
<p>
Treat the two \(R\)-cubes as a single block \(RR\). The remaining multiset is \(\{RR, G,G, B,B, E,E,E\}\) of size 8 with multiplicities \(G:2, B:2, E:3\). Thus
\[
N(A_R)=\frac{8!}{2!\,2!\,3!}.
\]
Compute:
</p>
\begin{align*}
8!&=40\,320,\\
2!\,2!\,3!&=2\cdot2\cdot6=24,\\
N(A_R)&=\frac{40\,320}{24}=1\,680.
\end{align*}


<p>
By symmetry the same value holds for \(N(A_G)\) and \(N(A_B)\). Hence
\[
\sum_X N(A_X)=3\cdot1\,680=5\,040.
\]
</p>
</div>
</div>
<div id="outline-container-orge6b0e17" class="outline-4">
<h4 id="orge6b0e17">Two colours adjacent (e.g. \(A_R\cap A_G\))</h4>
<div class="outline-text-4" id="text-orge6b0e17">
<p>
Treat \(RR\) and \(GG\) as two blocks. The remaining multiset is \(\{RR,GG,B,B,E,E,E\}\) of size 7 with multiplicities \(B:2, E:3\). Thus
\[
N(A_R\cap A_G)=\frac{7!}{2!\,3!}.
\]
Compute:
</p>
\begin{align*}
7!&=5\,040,\\
2!\,3!&=2\cdot6=12,\\
N(A_R\cap A_G)&=\frac{5\,040}{12}=420.
\end{align*}


<p>
There are \(\binom{3}{2}=3\) unordered pairs of colours, so
\[
\sum_{X\lt Y} N(A_X\cap A_Y) = 3\cdot420 = 1260.
\]
</p>
</div>
</div>
<div id="outline-container-org92c7ca2" class="outline-4">
<h4 id="org92c7ca2">All three colours adjacent (\(A_R\cap A_G\cap A_B\))</h4>
<div class="outline-text-4" id="text-org92c7ca2">
<p>
Treat \(RR,GG,BB\) as three blocks. The remaining multiset is \(\{RR,GG,BB,E,E,E\}\) of size 6 with multiplicity \(E:3\). Thus
\[
N(A_R\cap A_G\cap A_B)=\frac{6!}{3!}.
\]
Compute:
</p>
\begin{align*}
6!&=720,\\
3!&=6,\\
N(A_R\cap A_G\cap A_B)&=\frac{720}{6}=120.
\end{align*}
</div>
</div>
</div>
<div id="outline-container-org9105297" class="outline-3">
<h3 id="org9105297">Put everything together</h3>
<div class="outline-text-3" id="text-org9105297">
<p>
Apply inclusion–exclusion:
</p>

<p>
N<sub>good</sub>
= N<sub>total</sub> - &sum;<sub>X</sub> N(A<sub>X</sub>) + &sum;<sub>X&lt;Y</sub> N(A<sub>X&cap;</sub> A<sub>Y</sub>) - N(A<sub>R&cap;</sub> A<sub>G&cap;</sub> A<sub>B</sub>)
= 7560 - 5040 + 1260 - 120 = 3660.
</p>

<p>
Therefore there are \(\boxed{3\,660}\) admissible arrangements.
</p>
</div>
</div>
</div>
<div id="outline-container-org2a5a050" class="outline-2">
<h2 id="org2a5a050">Lean</h2>
<div class="outline-text-2" id="text-org2a5a050">
<div class="org-src-container">
<pre class="src src-haskell">inductive Color where
  | R | G | B | E
  deriving Repr, DecidableEq

structure Counts where
  r : Nat
  g : Nat
  b : Nat
  e : Nat
  deriving Repr

def countsZero (c : Counts) : Bool :=
  c.r == 0 &amp;&amp; c.g == 0 &amp;&amp; c.b == 0 &amp;&amp; c.e == 0

def decCount (c : Counts) (col : Color) : Counts :=
  match col with
  | Color.R =&gt; { c with r := c.r - 1 }
  | Color.G =&gt; { c with g := c.g - 1 }
  | Color.B =&gt; { c with b := c.b - 1 }
  | Color.E =&gt; { c with e := c.e - 1 }

-- allowed choices given remaining counts and previous placed color
def allowed (counts : Counts) (prev : Option Color) : List Color :=
  let ok (col : Color) (avail : Nat) : Bool :=
    avail &gt; 0 &amp;&amp;
    match prev with
    | none =&gt; true
    | some p =&gt; (p != col) || (col == Color.E) -- empties may repeat; colored must differ
  ([Color.R, Color.G, Color.B, Color.E]).filter fun col =&gt;
    match col with
    | Color.R =&gt; ok Color.R counts.r
    | Color.G =&gt; ok Color.G counts.g
    | Color.B =&gt; ok Color.B counts.b
    | Color.E =&gt; ok Color.E counts.e

partial def build (rem : Nat) (prev : Option Color) (counts : Counts) : List (List Color) :=
  if rem == 0 then
    if countsZero counts then [ [] ] else []
  else
    let choices := allowed counts prev
    -- avoid using `List.bind` in case of name-resolution differences;
    -- build result by folding over choices and appending mapped tails
    choices.foldl (fun acc c =&gt;
      let counts' := decCount counts c
      let tails := build (rem - 1) (some c) counts'
      acc ++ (tails.map fun t =&gt; c :: t)
    ) []

def showColor : Color -&gt; String
  | Color.R =&gt; "R"
  | Color.G =&gt; "G"
  | Color.B =&gt; "B"
  | Color.E =&gt; "."

def main : IO Unit := do
  let initial : Counts := { r := 2, g := 2, b := 2, e := 3 }
  let solutions := build 9 none initial
  IO.println s!"Found {solutions.length} solutions (each printed as a 9-length sequence; '.' = empty)"
  for s in solutions do
    IO.println (String.intercalate " " (s.map showColor))

</pre>
</div>
</div>
</div>
