cubes/cubes_en.html
<div id="outline-container-org19a3ee0" class="outline-2">
<h2 id="org19a3ee0">Haskell</h2>
<div class="outline-text-2" id="text-org19a3ee0">
<div class="org-src-container">
<pre class="src src-haskell">module Main where

data Color = R | G | B | E
  deriving (Eq, Show)

data Counts = Counts
  { cr :: Int
  , cg :: Int
  , cb :: Int
  , ce :: Int
  } deriving (Show)

countsZero :: Counts -&gt; Bool
countsZero (Counts r g b e) = r == 0 &amp;&amp; g == 0 &amp;&amp; b == 0 &amp;&amp; e == 0

decCount :: Counts -&gt; Color -&gt; Counts
decCount c col = case col of
  R -&gt; c { cr = cr c - 1 }
  G -&gt; c { cg = cg c - 1 }
  B -&gt; c { cb = cb c - 1 }
  E -&gt; c { ce = ce c - 1 }

allowed :: Counts -&gt; Maybe Color -&gt; [Color]
allowed counts prev = filter ok [R, G, B, E]
  where
    avail c = case c of
      R -&gt; cr counts
      G -&gt; cg counts
      B -&gt; cb counts
      E -&gt; ce counts
    ok c =
      avail c &gt; 0 &amp;&amp;
      case prev of
        Nothing -&gt; True
        Just p  -&gt; (p /= c) || (c == E)  -- empties may repeat; colored must differ

-- build positions: rem = remaining slots to fill
build :: Int -&gt; Maybe Color -&gt; Counts -&gt; [[Color]]
build 0 _ counts = if countsZero counts then [[]] else []
build rem prev counts =
  concatMap extend (allowed counts prev)
  where
    extend c = map (c :) (build (rem - 1) (Just c) (decCount counts c))

showColor :: Color -&gt; String
showColor R = "R"
showColor G = "G"
showColor B = "B"
showColor E = "."

main :: IO ()
main = do
  let initial = Counts { cr = 2, cg = 2, cb = 2, ce = 3 }
      solutions = build 9 Nothing initial
  putStrLn $ "Found " ++ show (length solutions) ++ " solutions ('.' = empty)"
  mapM_ (putStrLn . unwords . map showColor) solutions

</pre>
</div>
</div>
</div>
