cubes/cubes_en.html
<div id="outline-container-org66bccab" class="outline-2">
<h2 id="org66bccab">Rust</h2>
<div class="outline-text-2" id="text-org66bccab">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #10b1fe;">use</span> <span style="color: #9f7efe;">std</span>::fmt;

<span style="color: #7a82da; font-weight: bold;">#[derive(Clone, Copy, Debug, PartialEq, Eq)]</span>
<span style="color: #10b1fe;">enum</span> <span style="color: #ff6480;">Color</span> {
    <span style="color: #ff6480;">R</span>,
    <span style="color: #ff6480;">G</span>,
    <span style="color: #ff6480;">B</span>,
    <span style="color: #ff6480;">E</span>,
}

<span style="color: #10b1fe;">impl</span> <span style="color: #9f7efe;">fmt</span>::<span style="color: #ff6480;">Display</span> <span style="color: #10b1fe;">for</span> <span style="color: #ff6480;">Color</span> {
    <span style="color: #10b1fe;">fn</span> <span style="color: #3fc56b;">fmt</span>(<span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">self</span>, <span style="color: #8bcdef;">f</span>: <span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">mut</span> <span style="color: #9f7efe;">fmt</span>::<span style="color: #ff6480;">Formatter</span>&lt;'<span style="color: #8bcdef;">_</span>&gt;) -&gt; <span style="color: #9f7efe;">fmt</span>::<span style="color: #ff6480;">Result</span> {
        <span style="color: #10b1fe;">let</span> <span style="color: #8bcdef;">s</span> = <span style="color: #10b1fe;">match</span> <span style="color: #10b1fe;">self</span> {
            <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">R</span> =&gt; <span style="color: #f9c859;">"R"</span>,
            <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">G</span> =&gt; <span style="color: #f9c859;">"G"</span>,
            <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">B</span> =&gt; <span style="color: #f9c859;">"B"</span>,
            <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">E</span> =&gt; <span style="color: #f9c859;">"."</span>,
        };
        <span style="color: #3fc56b;">write!</span>(f, <span style="color: #f9c859;">"</span><span style="color: #f9c859; font-style: italic;">{}</span><span style="color: #f9c859;">"</span>, s)
    }
}

<span style="color: #7a82da; font-weight: bold;">#[derive(Clone, Copy, Debug)]</span>
<span style="color: #10b1fe;">struct</span> <span style="color: #ff6480;">Counts</span> {
    <span style="color: #8bcdef;">r</span>: <span style="color: #ff6480;">u32</span>,
    <span style="color: #8bcdef;">g</span>: <span style="color: #ff6480;">u32</span>,
    <span style="color: #8bcdef;">b</span>: <span style="color: #ff6480;">u32</span>,
    <span style="color: #8bcdef;">e</span>: <span style="color: #ff6480;">u32</span>,
}

<span style="color: #10b1fe;">impl</span> <span style="color: #ff6480;">Counts</span> {
    <span style="color: #10b1fe;">fn</span> <span style="color: #3fc56b;">zero</span>(<span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">self</span>) -&gt; <span style="color: #ff6480;">bool</span> {
        <span style="color: #10b1fe;">self</span>.r == <span style="color: #ff78f8; font-weight: bold;">0</span> &amp;&amp; <span style="color: #10b1fe;">self</span>.g == <span style="color: #ff78f8; font-weight: bold;">0</span> &amp;&amp; <span style="color: #10b1fe;">self</span>.b == <span style="color: #ff78f8; font-weight: bold;">0</span> &amp;&amp; <span style="color: #10b1fe;">self</span>.e == <span style="color: #ff78f8; font-weight: bold;">0</span>
    }
}

<span style="color: #f9c859;">/// decrement one count of `col` (caller must ensure availability &gt; 0)</span>
<span style="color: #10b1fe;">fn</span> <span style="color: #3fc56b;">dec_count</span>(<span style="color: #10b1fe;">mut</span> <span style="color: #8bcdef;">c</span>: <span style="color: #ff6480;">Counts</span>, <span style="color: #8bcdef;">col</span>: <span style="color: #ff6480;">Color</span>) -&gt; <span style="color: #ff6480;">Counts</span> {
    <span style="color: #10b1fe;">match</span> col {
        <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">R</span> =&gt; c.r -= <span style="color: #ff78f8; font-weight: bold;">1</span>,
        <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">G</span> =&gt; c.g -= <span style="color: #ff78f8; font-weight: bold;">1</span>,
        <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">B</span> =&gt; c.b -= <span style="color: #ff78f8; font-weight: bold;">1</span>,
        <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">E</span> =&gt; c.e -= <span style="color: #ff78f8; font-weight: bold;">1</span>,
    }
    c
}

<span style="color: #f9c859;">/// allowed choices given remaining counts and previous placed color</span>
<span style="color: #10b1fe;">fn</span> <span style="color: #3fc56b;">allowed</span>(<span style="color: #8bcdef;">counts</span>: <span style="color: #ff6480;">Counts</span>, <span style="color: #8bcdef;">prev</span>: <span style="color: #ff6480;">Option</span>&lt;<span style="color: #ff6480;">Color</span>&gt;) -&gt; <span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Color</span>&gt; {
    <span style="color: #10b1fe;">let</span> <span style="color: #10b1fe;">mut</span> <span style="color: #8bcdef;">v</span> = <span style="color: #ff6480;">Vec</span>::new();
    <span style="color: #10b1fe;">let</span> <span style="color: #8bcdef;">ok</span> = |<span style="color: #8bcdef;">col</span>: <span style="color: #ff6480;">Color</span>, <span style="color: #8bcdef;">avail</span>: <span style="color: #ff6480;">u32</span>| -&gt; <span style="color: #ff6480;">bool</span> {
        <span style="color: #10b1fe;">if</span> avail == <span style="color: #ff78f8; font-weight: bold;">0</span> {
            <span style="color: #10b1fe;">return</span> <span style="color: #10b1fe;">false</span>;
        }
        <span style="color: #10b1fe;">match</span> prev {
            <span style="color: #ff6480;">None</span> =&gt; <span style="color: #10b1fe;">true</span>,
            <span style="color: #ff6480;">Some</span>(p) =&gt; p != col || col == <span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">E</span>, <span style="color: #7a808b;">// </span><span style="color: #7a808b;">empties may repeat; colored must differ</span>
        }
    };
    <span style="color: #10b1fe;">if</span> ok(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">R</span>, counts.r) {
        v.push(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">R</span>);
    }
    <span style="color: #10b1fe;">if</span> ok(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">G</span>, counts.g) {
        v.push(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">G</span>);
    }
    <span style="color: #10b1fe;">if</span> ok(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">B</span>, counts.b) {
        v.push(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">B</span>);
    }
    <span style="color: #10b1fe;">if</span> ok(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">E</span>, counts.e) {
        v.push(<span style="color: #ff6480;">Color</span>::<span style="color: #ff6480;">E</span>);
    }
    v
}

<span style="color: #f9c859;">/// backtracking builder</span>
<span style="color: #10b1fe;">fn</span> <span style="color: #3fc56b;">backtrack</span>(
    <span style="color: #8bcdef;">rem</span>: <span style="color: #ff6480;">usize</span>,
    <span style="color: #8bcdef;">prev</span>: <span style="color: #ff6480;">Option</span>&lt;<span style="color: #ff6480;">Color</span>&gt;,
    <span style="color: #8bcdef;">counts</span>: <span style="color: #ff6480;">Counts</span>,
    <span style="color: #8bcdef;">current</span>: <span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">mut</span> <span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Color</span>&gt;,
    <span style="color: #8bcdef;">solutions</span>: <span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">mut</span> <span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Color</span>&gt;&gt;,
) {
    <span style="color: #10b1fe;">if</span> rem == <span style="color: #ff78f8; font-weight: bold;">0</span> {
        <span style="color: #10b1fe;">if</span> counts.zero() {
            solutions.push(current.clone());
        }
        <span style="color: #10b1fe;">return</span>;
    }

    <span style="color: #10b1fe;">for</span> <span style="color: #8bcdef;">col</span> <span style="color: #10b1fe;">in</span> allowed(counts, prev) {
        <span style="color: #10b1fe;">let</span> <span style="color: #8bcdef;">counts_next</span> = dec_count(counts, col);
        current.push(col);
        backtrack(rem - <span style="color: #ff78f8; font-weight: bold;">1</span>, <span style="color: #ff6480;">Some</span>(col), counts_next, current, solutions);
        current.pop();
    }
}

<span style="color: #10b1fe;">fn</span> <span style="color: #3fc56b;">main</span>() {
    <span style="color: #10b1fe;">let</span> <span style="color: #8bcdef;">initial</span> = <span style="color: #ff6480;">Counts</span> {
        <span style="color: #8bcdef;">r</span>: <span style="color: #ff78f8; font-weight: bold;">2</span>,
        <span style="color: #8bcdef;">g</span>: <span style="color: #ff78f8; font-weight: bold;">2</span>,
        <span style="color: #8bcdef;">b</span>: <span style="color: #ff78f8; font-weight: bold;">2</span>,
        <span style="color: #8bcdef;">e</span>: <span style="color: #ff78f8; font-weight: bold;">3</span>,
    };
    <span style="color: #10b1fe;">let</span> <span style="color: #10b1fe;">mut</span> <span style="color: #8bcdef;">solutions</span>: <span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Color</span>&gt;&gt; = <span style="color: #ff6480;">Vec</span>::new();
    <span style="color: #10b1fe;">let</span> <span style="color: #10b1fe;">mut</span> <span style="color: #8bcdef;">current</span>: <span style="color: #ff6480;">Vec</span>&lt;<span style="color: #ff6480;">Color</span>&gt; = <span style="color: #ff6480;">Vec</span>::with_capacity(<span style="color: #ff78f8; font-weight: bold;">9</span>);
    backtrack(<span style="color: #ff78f8; font-weight: bold;">9</span>, <span style="color: #ff6480;">None</span>, initial, <span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">mut</span> current, <span style="color: #abb2bf; background-color: #282c34;">&amp;</span><span style="color: #10b1fe;">mut</span> solutions);

    <span style="color: #3fc56b;">println!</span>(
        <span style="color: #f9c859;">"Found </span><span style="color: #f9c859; font-style: italic;">{}</span><span style="color: #f9c859;"> solutions (each printed as a 9-length sequence; '.' = empty)"</span>,
        solutions.len()
    );
    solutions.iter().for_each(|s| {
        <span style="color: #10b1fe;">let</span> <span style="color: #8bcdef;">line</span> = s.iter()
                .map(|c| c.to_string())
                .collect::&lt;<span style="color: #ff6480;">Vec</span>&lt;_&gt;&gt;()
                .join(<span style="color: #f9c859;">" "</span>);
        <span style="color: #3fc56b;">println!</span>(<span style="color: #f9c859;">"</span><span style="color: #f9c859; font-style: italic;">{}</span><span style="color: #f9c859;">"</span>, line);
    });

}

</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: emporas</p>
<p class="date">Created: 2025-09-28 Sun 02:38</p>
</div>
</body>
</html>
